Autodesk.Revit.DB.CurvedEdgeConditionParam
The allowed values for the HOST_SSE_CURVED_EDGE_CONDITION_PARAM parameter.

Autodesk.Revit.DB.CurvedEdgeConditionParam.ProjectToSideFace
Project to side

Autodesk.Revit.DB.CurvedEdgeConditionParam.ConformToCurve
Conform to curve

Autodesk.Revit.DB.CurvedEdgeConditionParam.NotApplicable
Not Applicable